# Concatenación de dataframes

concatenar es juntar, unir,  fusionar

Para df existen diferentes metodos: Concat, Merge, Join

## Concat

Esta tecnica se centra en bases de datos comunes, o sea tienen las mismas columnas y por lo tanto, hay que juntar las columnas

In [1]:
import pandas as pd

In [3]:
df1= pd.DataFrame({'A':['1A','2B'],'B':['1B','2B'],'C':['1C','2C']})
df1

    A   B   C
0  1A  1B  1C
1  2B  2B  2C

In [4]:
df2= pd.DataFrame({'A':['6A','7A','8A'], 'B':['6B','7B','8B'],'C':['6C','7C','8C']})
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [9]:
pd.concat([df1,df2], ignore_index=True) #ignore index=True es para que no se mantengan los index de los df originales

    A   B   C
0  1A  1B  1C
1  2B  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

## Merge 

Esta técnica fusiona diferentes df a patir de una columna en común

In [12]:
df1= pd.DataFrame({'A':['1A','2A'],'B':['1B','2B']})
df2= pd.DataFrame ({'A':['1A','2A'],'C':['1C','2C'], 'K':['1K','2K']})

In [13]:
pd.merge(df1,df2, on=['A']) #on es respecto a que (pibote) para fusionar

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

Puede utilizarse con how= 'inner' o 'outer'

inner buscara los datos en la interseccion de la llave especificada, seria la intersección entre conjuntos A y B 

outer buscara los datos que pertenescan a los conjuntos A o B 

left buscara el 'left outer', o sea aquellos datos que pertenezcan a B menos A

## Join

Combinar columnas de dos df indexados

In [23]:
df1=pd.DataFrame({'Z':['1A','2A','3A'],'B':['1B','2B','3B']}, index =['i1','i2','i3'])
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3B

In [27]:
df2=pd.DataFrame({'A':['5A','6A'],'C':['1C','2C'],'K':['1K','2K']}, index=['i1','i2'])
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [29]:
df3=df1.join(df2)

In [30]:
df3.to_csv('nombre.csv', index=False)

In [35]:
pd.read_csv('nosuchefileondirectory.csv')

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN